{
  "ISTJ": {
    "desription": "사실을 바탕으로 사고하며 이들의 행동이나 결정 사항에 한 치의 의심을 사지 않는 현실주의자형ISTJ는 리얼리스트 보스턴 프리지아 (Boston Fern): 적극적이면서도 현실적인 ISTJ 유형에게 적합한 실내 식물입니다."
  },

  "ISFJ": {
    "description": "주변 소중한 이들을 수호하는 데 심혀을 기울이는 헌신적이며 성실한 방어자형인 ISFJ는 차꽃 (Camellia): 풍성한 꽃잎과 단단한 잎사귀로 이루어져 있으며, 지지력과 끈기를 상징하는 ISFJ 유형에게 좋은 선택입니다. "
  },
  "INFJ": {
    "description": "조용하고 신비로운 타입으로 샘솟는 영감으로 인해 지칠줄 모르는 이상주의자 INFJ는 우아하고 아름다운 벚꽃은 고요하면서도 감성적인 INFJ 유형에게 매우 어울립니다."
  },
  "INTJ": {
    "description": "풍부한 상상력으로 철두철미한 계획을 세워내는 전략가형인 INTJ는 히비스커스 (Hibiscus): 창조적이면서도 독창적인 아이디어를 가진 INTJ 유형에게 좋은 선택입니다."
  },
  "ISTP": {
    "description": "대담하고 현실적인 성향으로 다양한 도구 사용에 능숙한 탐험형인 ISTP는 복수초 (Buttercup): 온화하고 용감한 모습으로 ISTP 유형에게 좋은 선택입니다."
  },
  "ISFP": {
    "description": "늘 새로운 것을 찾아 시도하고 도전할 준비가 되어 있으며 융통성 있는 성격의 매력 넘치는 예술가형인 ISFP는 예술가 카네이션 (Carnation): 다양한 색상으로 이루어져 있으며, 예술적인 멋을 가진 ISFP 유형에게 적합한 꽃입니다."
  },
  "INFP": {
    "description": "상냥한 성격의 이타주의자로 건강하고 좋은 사회 건설을 위해 앞장서는 낭만형인 INFP는 중재자 튤립 (Tulip): 감성적이면서도 정신적인 안정을 추구하는 INFP 유형에게 적합한 꽃입니다."
  },
  "INTP": {
    "description": "깊은 사색과 창조적인 아이디어를 가진 INTP 유형에게 적합한 꽃입니다. 제비꽃 (Morning Glory): 인텔리전스와 융통성이 뛰어난 INTP 유형에게 좋은 선택입니다."
  },
  "ESTJ": {
    "desription": "사물이나 사람을 관리하는 데 뛰어난 시력을 갖춘 관리자형 ESTJ는 (백합) (Lily): 능력과 통제력을 지닌 ESTJ 유형에게 적합한 꽃입니다."
  },

  "ESFJ": {
    "description": "타인에게 세심한 관심을 가지며 사교적인 성향 덕분에 사람들 사이에서 인기가 많으며, 타인을 돕는데 열성적인 세심형인 ESTJ는 바이올렛 (Violet): 다른 사람을 배려하고 챙기는 것을 중요시하는 ESFJ 유형에게 좋은 선택입니다."
  },
  "ENFJ": {
    "description": "언변능숙형으로 온화하고 적극적이며 책임감이 강하고 사교성이 풍부해 동정심이 많은 ENFJ는 해바라기 : 인간애와 따뜻한 마음을 지닌 ENFJ 유형에게 적합한 꽃입니다."
  },
  "ENTJ": {
    "description": "대담하고 상상력이 풍부한 강한 의지의 소유자로 상황이 여의치 않을 경우에도 새로운 방안을 창출하는 리더형인 ENTJ는 지도자 레드로즈 (Red Rose): 대담하고 명확한 지도력을 가진 ENTJ 유형에게 적합한 꽃입니다."
  },
  "ESTP": {
    "description": "벼랑 끝의 아슬아슬한 삶을 즐길 줄 아는 사람으로 명석한 두뇌와 에너지, 그리고 훌륭한 직관력을 가지벼랑고 있는 ESTP는 로즈마리 (Rosemary): 열정적이고 경쟁적인 ESTP 유형에게 좋은 선택입니다. "
  },
  "ESFP": {
    "description": "긍적적인 에너지를 발휘하며 주위에 있으면 인생이 지루할 일이 없을 정도로 즉흥적이며 열정과 에너지가 넘치는 연예인형인 ESFP는 선인장: 사교성이 뛰어나고 창의력이 풍부한 ESFP 유형에게 적합한 꽃입니다."
  },
  "ENFP": {
    "description": "창의적이며 항상 웃을 거리를 찾아다니는 활발한 성격으로 사람들과 자유롭게 어울리기 좋아하는 무한 열정의 소유자인 ENFP는 데이지 (Daisy): 삶의 즐거움을 추구하며, 긍정적이고 활기찬 ENFP 유형에게 좋은 선택입니다."
  },
  "ENTP": {
    "description": "지적인 도전을 두려워하지 않는 똑똑한 호기심형인 ENTP는 변론가 드리지움 (Begonia): 독창적인 사고를 지닌 ENTP 유형에게 적합한 꽃입니다. 선인장 (Cactus): 고집이 센 ENTP 유형에게 좋은 선택입니다."
  }
}
